'use strict';
export default {
  // 任务列表数据
  taskData: [
    {
      id: 0,
      title: '任务标题1',
      desc: '任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务',
      endTime: '2016-01-01',
      time: '01-01',
      isGrab: false
    },
    {
      id: 1,
      title: '任务标题2',
      desc: '任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务任务',
      endTime: '2016-01-01',
      time: '01-01',
      isGrab: false
    }
  ],
  // 赌注数据
  bet: [
    {
      score: 500,
      checked: true
    },
    {
      score: 1000,
      checked: false
    },
    {
      score: 5000,
      checked: false
    }
  ],
  
  timinggrab:[
    {
      ico: '',
      status: 0,
      desc: [
        '起床红包',
        '01:17开始抢, 消除起床气'
      ],
      desc1: [
        '起床红包',
        '01:17开始抢, 消除起床气'
      ]
    },
    {
      ico: '',
      status: 1,
      desc: [
        '午休红包',
        '12:17开始抢, 精神一下午'
      ],
      desc1: [
        '午休红包',
        '12:17开始抢, 精神一下午'
      ]
    },
    {
      ico: '',
      status: 1,
      desc: [
        '晚餐红包',
        '17:17开始抢, 健胃又消食'
      ],
      desc1: [
        '晚餐红包',
        '17:17开始抢, 健胃又消食'
      ]
    },
    {
      ico: '',
      status: 1,
      desc: [
        '睡前红包',
        '22:17开始抢, 一夜睡香香'
      ],
      desc1: [
        '睡前红包',
        '22:17开始抢, 一夜睡香香'
      ]
    }    
  ],
  // 未使用
  lotto: {
    // 1: '',
    2: [1,1],
    3: [1,2],
    4: [[1,3], [2,2]],
    5: [[1,4], [2,3]],
    6: [[1,5], [2,4], [3,3]],
    7: [[1,6], [2,5], [3,4]],
    8: [[2,6], [3,5], [4,4]],
    9: [[3,6], [4,5]],
    10: [[4,6], [5,5]],
    11: [5,6],
    12: [6,6]
  }
}